Revit 2024 API
WallFunction Enumeration
 Indicates the function of a specified WallType, as specified in the parameter FUNCTION_PARAM on the WallType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum WallFunction
Visual Basic
Public Enumeration WallFunction
Visual C++
public enum class WallFunction
Members
Member name | Description
Interior |  An interior wall.
Exterior |  An exterior wall.
Foundation |  A foundation wall.
Retaining |  A retaining wall.
Soffit |  A soffit wall.
Coreshaft |  A coreshaft wall.
See Also
Autodesk.Revit.DB Namespace